##################################################
# pygame 이해하기 
##################################################

import pygame
import sys
import time

# 초기화 작업
# 반드시 주어진 함수이름과 순서를 지켜야 함.

pygame.init()
screen = pygame.display.set_mode((400, 300))
pygame.display.set_caption("pygame 이해하기")

################################################################
#  아래에서 무한루프가 돌기 때문에 화면을 빠져나올 수가 없게 됨.
################################################################
while True:

    ################################################################
    # drawing 과 같은 화면에 그리기를 하고 난 후
    #   반드시 display.update()를 해야 그린 화면이 갱신(다시그림)이 발생함.
    # display.update()는 컴퓨터 자원(CPU 등)을 많이 사용하기 때문에 
    #   게임의 메인 루프에서 마지막에 한 번만 호출되게 작성하는 것이 원칙임.
    ################################################################
    pygame.draw.line(screen, (0, 0, 255), (20, 100), (200, 300), 4)

    pygame.display.update()

    # 루프의 속도를 조금 정체시켜줌.
    time.sleep(0.1)

# pygame 의 (0, 0) 위치는 왼쪽 상단임을 알 수 있다.